note/drawio/converted/dot/260506-untitled-diagram.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_7NoLvqlB_6QXBLo4ep7x_1" [label="node_ep7x-1"];
  "n_7NoLvqlB_6QXBLo4ep7x_11" [label="node_p7x-11"];
  "n_7NoLvqlB_6QXBLo4ep7x_12" [label="Sync L"];
  "n_7NoLvqlB_6QXBLo4ep7x_14" [label="node_p7x-14"];
  "n_7NoLvqlB_6QXBLo4ep7x_15" [label="STOP"];
  "n_7NoLvqlB_6QXBLo4ep7x_18" [label="node_p7x-18"];
  "n_7NoLvqlB_6QXBLo4ep7x_19" [label="DATA_count"];
  "n_7NoLvqlB_6QXBLo4ep7x_21" [label="node_p7x-21"];
  "n_7NoLvqlB_6QXBLo4ep7x_22" [label="Decision_DATA"];
  "n_7NoLvqlB_6QXBLo4ep7x_24" [label="dht11 =1 &&out_se; =1 (3_state buffer)"];
  "n_7NoLvqlB_6QXBLo4ep7x_25" [label="start ==1"];
  "n_7NoLvqlB_6QXBLo4ep7x_27" [label="dht 11 =0"];
  "n_7NoLvqlB_6QXBLo4ep7x_28" [label="> 18msec"];
  "n_7NoLvqlB_6QXBLo4ep7x_3" [label="IDLE"];
  "n_7NoLvqlB_6QXBLo4ep7x_30" [label="dht 11 =1"];
  "n_7NoLvqlB_6QXBLo4ep7x_31" [label="30usec"];
  "n_7NoLvqlB_6QXBLo4ep7x_33" [label="out_sel =0"];
  "n_7NoLvqlB_6QXBLo4ep7x_34" [label="출력 끊어도 상관 없음. drive 아니니까. 읽는건 걍 읽으셈"];
  "n_7NoLvqlB_6QXBLo4ep7x_36" [label="node_p7x-36"];
  "n_7NoLvqlB_6QXBLo4ep7x_37" [label="Sync H"];
  "n_7NoLvqlB_6QXBLo4ep7x_39" [label="out_sel =0"];
  "n_7NoLvqlB_6QXBLo4ep7x_40" [label="> 50usec (dht11 ==1)"];
  "n_7NoLvqlB_6QXBLo4ep7x_41" [label="High 구간을 50usec && dht11 ==0 까지 기다리자 -> data sync 로 내보냄 따로 출력 x"];
  "n_7NoLvqlB_6QXBLo4ep7x_42" [label="node_p7x-42"];
  "n_7NoLvqlB_6QXBLo4ep7x_43" [label="DATA Sync"];
  "n_7NoLvqlB_6QXBLo4ep7x_45" [label="out_sel =0"];
  "n_7NoLvqlB_6QXBLo4ep7x_46" [label=">= 50 usec&dht 11 == 0"];
  "n_7NoLvqlB_6QXBLo4ep7x_48" [label="dht 11 == 1"];
  "n_7NoLvqlB_6QXBLo4ep7x_49" [label="0 or 1 판별, Data_reg 에 저장 , dht11 == 0"];
  "n_7NoLvqlB_6QXBLo4ep7x_5" [label="node_ep7x-5"];
  "n_7NoLvqlB_6QXBLo4ep7x_50" [label="bit_CNT <40"];
  "n_7NoLvqlB_6QXBLo4ep7x_51" [label="bit_CNT == 40"];
  "n_7NoLvqlB_6QXBLo4ep7x_52" [label="50 usec & out_sel = 1"];
  "n_7NoLvqlB_6QXBLo4ep7x_6" [label="START"];
  "n_7NoLvqlB_6QXBLo4ep7x_8" [label="node_ep7x-8"];
  "n_7NoLvqlB_6QXBLo4ep7x_9" [label="WAIT"];
  "n_7NoLvqlB_6QXBLo4ep7x_5" -> "n_7NoLvqlB_6QXBLo4ep7x_8";
  "n_7NoLvqlB_6QXBLo4ep7x_8" -> "n_7NoLvqlB_6QXBLo4ep7x_11";
  "n_7NoLvqlB_6QXBLo4ep7x_14" -> "n_7NoLvqlB_6QXBLo4ep7x_1";
  "n_7NoLvqlB_6QXBLo4ep7x_18" -> "n_7NoLvqlB_6QXBLo4ep7x_21";
  "n_7NoLvqlB_6QXBLo4ep7x_21" -> "n_7NoLvqlB_6QXBLo4ep7x_42";
  "n_7NoLvqlB_6QXBLo4ep7x_36" -> "n_7NoLvqlB_6QXBLo4ep7x_42";
}
